data = [r"""
МУЗЫКАЛЬНЫЕ ПРЕДПОЧТЕНИЯ
\begin{enumerate}
""", """
    Мне нравится слушать музыку: Категорически не согласен 1-2-3-4-5 Полностью согласен (целочисленный)
    Я предпочитаю: Медленная музыка 1-2-3-4-5 Быстрая музыка (целое)
    Dance, Disco, Funk: Не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целочисленным)
    Народная музыка: не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целочисленным)
    Страна: Не нравится вообще 1-2-3-4-5 Наслаждайтесь очень (целочисленным)
    Классика: Не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целочисленным)
    Мюзиклы: Не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целыми)
    Поп: Не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целочисленным)
    Рок: Не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целыми)
    Металл, хард-рок: не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целочисленным)
    Панк: Не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целочисленным)
    Хип-хоп, Рэп: Не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целочисленным)
    Reggae, Ska: не нравится вообще 1-2-3-4-5 Наслаждайтесь очень (целочисленным)
    Swing, Jazz: не нравится вообще 1-2-3-4-5 Наслаждайтесь очень (целыми)
    Рок-н-ролл: не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целочисленным)
    Альтернативная музыка: не нравится вообще 1-2-3-4-5 Наслаждайтесь очень (целочисленным)
    Латынь: не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целочисленным)
    Техно, Транс: Не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целочисленным)
    Опера: Не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целочисленным)
""", r"""
\end{enumerate}
ФИЛЬМЫ ПРЕДПОЧТЕНИЯ
\begin{enumerate}
""", """
    Мне очень нравится смотреть фильмы: Сильно не согласен 1-2-3-4-5 Полностью согласен (целочисленный)
    Фильмы ужасов: не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целыми)
    Триллеры: не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целыми)
    Комедии: не нравится вообще 1-2-3-4-5 Наслаждайтесь очень (целыми)
    Романтические фильмы: Не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целыми)
    Научно-фантастические фильмы: Не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целыми)
    Военные фильмы: не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целыми)
    Сказки: Не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целочисленным)
    Мультфильмы: Не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целочисленным)
    Документальные фильмы: не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целочисленным)
    Западные фильмы: Не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целыми)
    Экшн фильмы: Не наслаждайтесь вообще 1-2-3-4-5 Наслаждайтесь очень (целыми)
""", r"""
\end{enumerate}
ХОББИ ИНТЕРЕСЫ
\begin{enumerate}
""", """
    История: Не интересует 1-2-3-4-5 Очень интересно (целое)
    Психология: не интересует 1-2-3-4-5 Очень интересно (целое)
    Политика: Не интересует 1-2-3-4-5 Очень интересно (целое)
    Математика: не интересует 1-2-3-4-5 Очень интересно (целое)
    Физика: не интересует 1-2-3-4-5 Очень интересно (целое)
    Интернет: не интересует 1-2-3-4-5 Очень интересно (целое)
    Программное обеспечение для ПК, Оборудование: Не интересует 1-2-3-4-5 Очень интересно (целое)
    Экономика, Менеджмент: Не интересует 1-2-3-4-5 Очень интересно (целое)
    Биология: не интересует 1-2-3-4-5 Очень интересно (целое)
    Химия: не интересует 1-2-3-4-5 Очень интересно (целое)
    Чтение стихов: Не интересует 1-2-3-4-5 Очень интересно (целое)
    География: Не интересует 1-2-3-4-5 Очень интересно (целое)
    Иностранные языки: не интересуются 1-2-3-4-5 Очень интересно (целое)
    Медицина: не интересует 1-2-3-4-5 Очень интересно (целое)
    Закон: не интересует 1-2-3-4-5 Очень интересно (целое)
    Автомобили: Не интересует 1-2-3-4-5 Очень интересно (целое)
    Искусство: Не интересует 1-2-3-4-5 Очень интересно (целое)
    Религия: Не интересует 1-2-3-4-5 Очень интересно (целое)
    Мероприятия на свежем воздухе: не интересует 1-2-3-4-5 Очень интересно (целое)
    Танцы: не интересуются 1-2-3-4-5 Очень интересно (целое)
    Игра на музыкальных инструментах: не интересует 1-2-3-4-5 Очень интересно (целое)
    Поэзия: Не интересно 1-2-3-4-5 Очень интересно (целое)
    Занятия спортом: Не интересуюсь 1-2-3-4-5 Очень интересно (целое)
    Спорт на конкурентном уровне: не интересует 1-2-3-4-5 Очень интересно (целое)
    Садоводство: Не интересует 1-2-3-4-5 Очень интересно (целое)
    Знаменитый образ жизни: не интересует 1-2-3-4-5 Очень интересно (целое)
    Покупки: Не интересует 1-2-3-4-5 Очень интересно (целое)
    Наука и техника: не интересует 1-2-3-4-5 Очень интересно (целое)
    Театр: не интересует 1-2-3-4-5 Очень интересно (целое)
    Общение: Не интересует 1-2-3-4-5 Очень интересно (целое)
    Адреналин спорт: не интересует 1-2-3-4-5 Очень интересно (целое)
    Домашние животные: Не интересуются 1-2-3-4-5 Очень интересно (целое)
""", r"""
\end{enumerate}
ФОБИИ
\begin{enumerate}
""", """
    Летающий: совсем не боится 1-2-3-4-5 Очень боится (целых)
    Гром, молния: совсем не боюсь 1-2-3-4-5 Очень боится (целое)
    Тьма: не боится совсем 1-2-3-4-5 Очень боится (целое)
    Высота: совсем не боится 1-2-3-4-5 Очень боится (целых)
    Пауки: совсем не боюсь 1-2-3-4-5 Очень боится (целых)
    Змеи: совсем не боюсь 1-2-3-4-5 Очень боится (целых)
    Крысы, мыши: совсем не боятся 1-2-3-4-5 Очень боится (целое)
""", r"""
\end{enumerate}
ЗДОРОВЬЕ
\begin{enumerate}
""","""
    Отношение к курению: Никогда не курил - Пробовал курить - Бывший курильщик - Текущий курильщик (категоричный)
    Пью: Никогда - Пью в компаниях - Пью много (категорично)
    Я живу очень здоровым образом жизни: сильно не согласен 1-2-3-4-5 Полностью согласен (целое)
""", r"""
\end{enumerate}
ТРЕНИРОВКА ЛИЧНОСТИ, ВЗГЛЯДЫ НА ЖИЗНЬ И МНЕНИЯ
\begin{enumerate}
""", """
    Я обращаю внимание на то, что происходит вокруг: сильно не согласен 1-2-3-4-5. Полностью согласен (целочисленный)
    Я стараюсь выполнять задания как можно скорее и не оставлять их до последней минуты .: Сильно не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я всегда составляю список, поэтому ничего не забываю: сильно не согласен 1-2-3-4-5 Полностью согласен (целочисленный)
    Я часто учусь или работаю даже в свободное время .: Сильно не согласен 1-2-3-4-5 Полностью согласен (целочисленный)
    Я смотрю на вещи с разных точек зрения, прежде чем идти вперед. Полностью не согласен 1-2-3-4-5. Полностью согласен (целое)
    Я считаю, что плохие люди пострадают в один прекрасный день, и хорошие люди будут вознаграждены. Полностью не согласен 1-2-3-4-5. Полностью согласен (целочисленный)
    Я надёжен на работе и всегда выполняю все заданные мне задачи: Полностью не согласен 1-2-3-4-5 Полностью согласен (целочисленный)
    Я всегда соблюдаю свои обещания: сильно не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я могу быстро попасть на кого-то, а затем полностью потерять интерес. Полностью не согласен 1-2-3-4-5. Полностью согласен (целочисленный)
    Я бы предпочел иметь много друзей, чем много денег. Полностью не согласен 1-2-3-4-5. Полностью согласен (целочисленный)
    Я всегда стараюсь быть самым смешным: сильно не согласен 1-2-3-4-5 Полностью согласен (целое)
    Иногда я могу столкнуться с двумя лицами: Полностью не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я повредил вещи в прошлом, когда сердился .: Сильно не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я не тороплюсь, чтобы принимать решения: сильно не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я всегда стараюсь голосовать на выборах: сильно не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я часто думаю и сожалею о принимаемых мной решениях: Полностью не согласен 1-2-3-4-5 Полностью согласен (целочисленный)
    Я могу сказать, слушают ли меня люди или нет, когда я говорю с ними: Полностью не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я ипохондрик. Полностью не согласен 1-2-3-4-5. Полностью согласен (целочисленный)
    Я - эмфатичный человек. Сильно не согласен 1-2-3-4-5 Полностью согласен (целочисленный)
    Я ем, потому что должен. Я не наслаждаюсь едой и еду так быстро, как могу: Категорически не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я стараюсь отдать столько, сколько я могу, другим людям на Рождество: сильно не согласен 1-2-3-4-5 Полностью согласен (целое)
    Мне не нравится встречаться с животными: Полностью не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я ухаживаю за вещами, которые я заимствовал у других: сильно не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я чувствую себя одиноким в жизни: Сильно не согласен 1-2-3-4-5 Полностью согласен (целое)
    Раньше я учился в школе: Сильно не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я беспокоюсь о своем здоровье: сильно не согласен 1-2-3-4-5 Полностью согласен (целочисленный)
    Хотел бы я изменить прошлое из-за того, что я сделал: Полностью не согласен 1-2-3-4-5 Сильно соглашаюсь (целое)
    Я верю в Бога: Полностью не согласен 1-2-3-4-5 Полностью согласен (целое)
    У меня всегда хорошие мечты: сильно не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я всегда отдаю благотворительность. Полностью не согласен 1-2-3-4-5. Полностью согласен (целое)
    У меня много друзей: сильно не согласен 1-2-3-4-5 Полностью согласен (целочисленный)
    Сроки: Я часто бываю на ранней стадии. - Я всегда вовремя. - Я часто опаздываю. (Категорично)
    Вы лжете другим: Никогда. - Только чтобы не причинять кому-либо вреда. Иногда. - Каждый раз мне это подходит. (Категорично)
    Я очень терпелив: сильно не согласен 1-2-3-4-5 Полностью согласен (целочисленный)
    Я могу быстро адаптироваться к новой среде .: Сильно не согласен 1-2-3-4-5 Полностью согласен (целое)
    Мое настроение меняется быстро: сильно не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я хорошо воспитан, и я ухаживаю за внешностью: Полностью не согласен 1-2-3-4-5 Полностью согласен (целое)
    Мне нравится встречаться с новыми людьми .: Сильно не согласен 1-2-3-4-5 Полностью согласен (целочисленный)
    Я всегда позволяю другим людям узнать о моих достижениях: Полностью не согласен 1-2-3-4-5 Полностью согласен (целочисленный)
    Я думаю, тщательно, прежде чем отвечать на любые важные письма .: Полностью не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я люблю детскую компанию: сильно не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я не боюсь высказать свое мнение, если я сильно о чем-то прокомментирую: Полностью не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я могу рассердиться очень легко: сильно не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я всегда убеждаюсь, что я соединяюсь с нужными людьми: сильно не согласен 1-2-3-4-5 Полностью согласен (целочисленный)
    Я должен быть хорошо подготовлен перед публичным выступлением: Полностью не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я найду в себе вину, если люди меня не любят. Полностью не согласен 1-2-3-4-5. Полностью согласен (целочисленный)
    Я плачу, когда чувствую себя, или все идет не так. Абсолютно не согласен 1-2-3-4-5. Полностью согласен (целое)
    Я на 100% доволен своей жизнью. Полностью не согласен 1-2-3-4-5. Полностью согласен (целое)
    Я всегда полна жизни и энергии: Полностью не согласен 1-2-3-4-5 Полностью согласен (целочисленный)
    Я предпочитаю крупных опасных собак более мелким, более спокойным собакам: Полностью не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я считаю, что все мои черты характера положительные: сильно не согласны 1-2-3-4-5. Полностью согласен (целочисленный)
    Если я найду что-то, что не принадлежит мне, я передам его. Полностью не согласен 1-2-3-4-5. Полностью согласен (целое)
    Мне очень трудно вставать утром: сильно не согласен 1-2-3-4-5 Полностью согласен (целое)
    У меня много разных увлечений и интересов: Полностью не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я всегда слушаю совет моих родителей: Полностью не согласен 1-2-3-4-5. Полностью согласен (целое)
    Мне нравится участвовать в опросах: сильно не согласен 1-2-3-4-5 Полностью согласен (целое)
    Сколько времени вы проводите в Интернете ?: Нет времени вообще - Менее часа в день - Несколько часов в день - Большая часть дня (категорично)
""", r"""
\end{enumerate}
ЗАТРАТНЫЕ ПРИВЫЧКИ
\begin{enumerate}
""", """
    Я могу сэкономить все, что могу. Полностью не согласен 1-2-3-4-5. Полностью согласен (целое)
    Мне нравится ходить в крупные торговые центры .: Сильно не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я предпочитаю фирменную одежду для немаркированных: сильно не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я трачу много денег на вечеринки и общение: Сильно не согласен 1-2-3-4-5 Полностью согласен (целочисленный)
    Я трачу много денег на внешний вид: сильно не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я трачу много денег на гаджеты: Полностью не согласен 1-2-3-4-5 Полностью согласен (целое)
    Я буду hapilly платить больше денег за хорошее, качественное или здоровое питание: Полностью не согласен 1-2-3-4-5 Полностью согласен (целое)
""", r"""
\end{enumerate}
Демография
\begin{enumerate}
""", """
   Возраст: (целое число)
     Высота: (целое)
     Вес: (целое)
     Сколько у вас братьев и сестер ?: (целое)
     Пол: Женский - Мужской (категоричный)
     Я: Левая рука - Правая (категоричная)
     Достигнуто высшее образование: В настоящее время ученик начальной школы - Начальная школа - Средняя школа - Колледж / Степень бакалавра (категорично)
     Я единственный ребенок: Нет - Да (категорично)
     Я провел большую часть своего детства в: Городской деревне (категорически)
     Я прожил большую часть своего детства в: доме / бунгало - многоквартирном доме (категорическом)
"""]

data = [d.split('\n')  for d in data if d]
print(data)
i  = []
for d in data:
    d = [item.strip() for item in d if item]
    for item in d:
        if not (item.find('(це') == -1):
            item = item.replace(item[item.find('(це'):], '(целое)', )
            item = '\item ' + item
        elif not (item.find('(ка') == -1):
            item = item.replace(item[item.find('(ка'):], '(Номинальная)', )
            item = '\item ' + item
        print()
        i.append(item)
data = i
for line in data:
        print(line)

print(len(data))
